BarclacardSmartPayNotificationService/WebserverTest/testXML.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com">
      <ns1:notification>
        <live xmlns="http://notification.services.adyen.com">false</live>
        <notificationItems xmlns="http://notification.services.adyen.com">
          <NotificationRequestItem>
            <additionalData xsi:ns1="true"/>
            <amount>
              <currency xmlns="http://common.services.adyen.com">EUR</currency>
              <value xmlns="http://common.services.adyen.com">1000</value>
            </amount>
            <eventCode>AUTHORISATION</eventCode>
            <eventDate>2009-01-01T01:02:01.111+02:00</eventDate>
            <merchantAccountCode>YourMerchantAccount</merchantAccountCode>
            <merchantReference>YourMerchantReference1</merchantReference>
            <operations>
              <string>CANCEL</string>
              <string>CAPTURE</string>
              <string>REFUND</string>
            </operations>
            <originalReference xsi:ns1="true"/>
            <paymentMethod>visa</paymentMethod>
            <pspReference>8888777766665555</pspReference>
            <reason>01234:1111:12/2012</reason>
            <success>true</success>
          </NotificationRequestItem>
          <NotificationRequestItem>
            <additionalData xsi:ns1="true"/>
            <amount>
              <currency xmlns="http://common.services.adyen.com">EUR</currency>
              <value xmlns="http://common.services.adyen.com">995</value>
            </amount>
            <eventCode>AUTHORISATION</eventCode>
            <eventDate>2009-01-01T01:01:01.111+02:00</eventDate>
            <merchantAccountCode>YourMerchantAccount</merchantAccountCode>
            <merchantReference>YourMerchantReference2</merchantReference>
            <operations>
              <string>CANCEL</string>
              <string>CAPTURE</string>
              <string>REFUND</string>
            </operations>
            <originalReference xsi:ns1="true"/>
            <paymentMethod>mc</paymentMethod>
            <pspReference>8888777766665556</pspReference>
            <reason>56789:1111:12/2012</reason>
            <success>true</success>
          </NotificationRequestItem>
        </notificationItems>
      </ns1:notification>
    </ns1:sendNotification>
  </soap:Body>
</soap:Envelope>
